#1:

Mostrar las primeras 5 filas de los dataframes

________________________________________________________________________________

In [127]:
import pandas as pd 

df_asig = pd.read_csv('../1_GENERADOR/asignaturas.csv')
df_est = pd.read_csv('../1_GENERADOR/estudiantes.csv')
df_not = pd.read_csv('../1_GENERADOR/notas.csv')

df_asig.head(5)

   id_asignatura nombre_asignatura departamento  creditos
0              1       Matemáticas     Ciencias         6
1              2            Física     Ciencias         5
2              3          Historia  Humanidades         4
3              4   Lengua Española  Humanidades        -1
4              5       Informática          NaN       100

In [128]:
df_est.head(5)

   id_estudiante       nombre    apellido  edad sexo     ciudad fecha_registro
0              1     Consuelo         NaN  25.0    M     Girona     2025-03-26
1              2          NaN       Boada  94.0    M    Cáceres     2022-07-10
2              3     Joaquina       Gomis  18.0    M      Cádiz     2024-01-01
3              4      Azeneth     Urrutia  20.0    F  Cantabria     2022-09-01
4              5  Luis Miguel  Goicoechea  30.0    1  Tarragona     2022-06-24

In [129]:
df_not.head(5)

   id_estudiante  id_asignatura  nota    convocatoria fecha_examen
0            1.0            5.0  7.25  Extraordinaria          NaN
1            1.0            7.0  6.29       Ordinaria   1998-02-26
2            1.0          999.0  7.47             NaN   2024-03-23
3            2.0            1.0  8.78  Extraordinaria   2023-11-05
4            2.0            7.0  6.15  Extraordinaria   2023-05-24

#2:

Mostrar información general de los dataframes

________________________________________________________________________________

In [130]:
df_asig.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id_asignatura      10 non-null     int64
 1   nombre_asignatura  9 non-null      object
 2   departamento       9 non-null      object
 3   creditos           10 non-null     int64
dtypes: int64(2), object(2)
memory usage: 452.0+ bytes

In [131]:
df_est.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_estudiante   1000 non-null   int64
 1   nombre          896 non-null    object
 2   apellido        892 non-null    object
 3   edad            961 non-null    float64
 4   sexo            955 non-null    object
 5   ciudad          903 non-null    object
 6   fecha_registro  952 non-null    object
dtypes: float64(1), int64(1), object(5)
memory usage: 54.8+ KB

In [132]:
df_not.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id_estudiante  2890 non-null   float64
 1   id_asignatura  2913 non-null   float64
 2   nota           2925 non-null   float64
 3   convocatoria   2855 non-null   object
 4   fecha_examen   2860 non-null   object
dtypes: float64(3), object(2)
memory usage: 117.3+ KB

#3:

Comprobar valores faltantes

________________________________________________________________________________

In [133]:
print(df_asig.isnull().sum())

id_asignatura        0
nombre_asignatura    1
departamento         1
creditos             0
dtype: int64

In [134]:
print(df_est.isnull().sum())

id_estudiante       0
nombre            104
apellido          108
edad               39
sexo               45
ciudad             97
fecha_registro     48
dtype: int64

In [135]:
print(df_not.isnull().sum())

id_estudiante    110
id_asignatura     87
nota              75
convocatoria     145
fecha_examen     140
dtype: int64

#4:

Calcular estadisticas numéricas

________________________________________________________________________________

In [136]:
print(df_asig.describe())

       id_asignatura    creditos
count       10.00000   10.000000
mean         5.50000   13.700000
std          3.02765   30.382926
min          1.00000   -1.000000
25%          3.25000    4.000000
50%          5.50000    5.000000
75%          7.75000    5.000000
max         10.00000  100.000000

In [137]:
print(df_est.describe())

       id_estudiante        edad
count    1000.000000  961.000000
mean      500.500000   30.381894
std       288.819436   15.615992
min         1.000000   -5.000000
25%       250.750000   22.000000
50%       500.500000   29.000000
75%       750.250000   35.000000
max      1000.000000  117.000000

In [138]:
print(df_not.describe())

       id_estudiante  id_asignatura         nota
count    2890.000000    2913.000000  2925.000000
mean      796.675087      39.608308     6.578021
std      1732.152414     181.885623     1.891631
min      -100.000000      -5.000000     0.000000
25%       233.250000       3.000000     5.530000
50%       499.000000       6.000000     6.610000
75%       770.000000       8.000000     7.690000
max      9999.000000     999.000000    10.000000

#5:

Comprobar duplicados

________________________________________________________________________________

In [139]:
print(df_asig.duplicated().sum())

0

In [140]:
print(df_est.duplicated().sum())

0

In [141]:
print(df_not.duplicated().sum())

0